Server/soapnew/WholeMapperSoapBinding.getProductListByInfo.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:lkf1="http://service.linexus.com/"
    xmlns:lkf2="http://dao.linexus.com/">
 <SOAP-ENV:Body>
   <lkf2:getProductListByInfo>
    <arg0>
     <productBuyNum>0</productBuyNum>
     <productDiscount>0.0</productDiscount>
     <productId>0</productId>
     <productImage></productImage>
     <productName></productName>
     <productNum>0</productNum>
     <productPrice>0</productPrice>
    </arg0>
   </lkf2:getProductListByInfo>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
